app/Controllers/usuario_controller.php

INSERT INTO `usuario` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('maria', 'gomes', 'maria', 'maria@gmail.com', '$2y$10$pV5KLEft0a.kWc9QD6kDyu9wIvexbKrUI4UZr/VCi25eTaTeCaS/i')
---
    public function formValidation()
    {
        $input = $this->validate([
            'nombre' => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'usuario' => 'required|min_length[3]',
            'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuario.email]',
            'pass' => 'required|min_length[3]|max_length[10]'
        ]);

        $formModel = new usuario_Model();

        if (!$input) {
            $data['titulo'] = 'Registro';
            echo view('front/head_view', $data);
            echo view('front/navbar_view');
            echo view('Back/usuario/registro', ['validation' => $this->validator]);
            echo view('front/footer_view');
        } else {
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email' => $this->request->getVar('email'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
            ]);